app/views/microposts/_micropost.html.erb

    <div class="comments_micropost">
      <% micropost.comments.each do |c| %>
        <% user = User.find_by id: c.user_id %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = ?  [["micropost_id", 300]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]