app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "abc"], ["user_id", 1], ["micropost_id", 300], ["created_at", "2016-08-02 11:04:36.539492"], ["updated_at", "2016-08-02 11:04:36.539492"]]
---
  def create
    @comment = Comment.new(content: params[:comment][:content],
      user_id: params[:user_id],
       micropost_id: params[:micropost_id])
    if @comment.save