app/controllers/static_pages_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships WHERE  follower_id = 1) OR user_id = 1)  ORDER BY "microposts"."created_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships WHERE  follower_id = 1) OR user_id = 1)
---
	def home
    if logged_in?
        @micropost = current_user.microposts.build if logged_in?
        @feed_items = current_user.feed.paginate(page: params[:page],
          :per_page => 10)