app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], :per_page => 15)
---
SELECT  "users".* FROM "users" LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "users"

  def edit
    @user = User.find params["id"]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @user = User.find params[:id]
    if @user.update_attributes user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$BX3zHjQzGZtayI.eebyvOeqB.TL7xfv8eESspY./1NmmD5zCFZqzS"], ["updated_at", "2016-08-02 09:33:16.853872"], ["id", 1]]

  def following
    @title = "Following"
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def followers
    @title = "Followers"
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]